AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Потолок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам/Ext/RecordSetModule.bsl
Функция ВыполнитьРасход(Знач ДокументСсылка, Знач Дата, Знач ЗаказПоставщику, Знач Организация, Знач ТаблицаТоваровКСписанию, Отказ) Экспорт
	
	//ТаблицаТоваровКСписанию = РегистрыНакопления.ЗаказыПоставщикам.ПолучитьТоварыКСписанию(Документ.Дата, ЗаказПоставщику, Организация, ТаблицаТовары);
	
	Если НЕ ТаблицаТоваровКСписанию.Итог("Количество") = 0 Тогда
		Попытка
			НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			НаборЗаписей.Прочитать();
			Для Каждого Товар Из ТаблицаТоваровКСписанию Цикл
				Расход = НаборЗаписей.Добавить();
				Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
				Расход.Период = Дата;
				Расход.ЗаказПоставщику = ЗаказПоставщику;
				Расход.Организация = Организация;
				Расход.Номенклатура = Товар.Номенклатура;
				Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				Расход.Потолок = Товар.Потолок;
				Расход.Цена = Товар.Цена;
				Расход.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
				Расход.Количество = Товар.Количество * Товар.Коэффициент;
				Расход.Сумма = Товар.Сумма; //#8742
			КонецЦикла;
			НаборЗаписей.Записать();

		Исключение
			Отказ = Истина;
			Сообщить("Ошибка закрытия заказа поставщику по регистру! " + ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьПриход(Знач Документ, Знач Организация, Знач ТаблицаТовары) Экспорт
	
	Результат = Истина;
	СоздатьДвижения = Истина;
	
	Если СоздатьДвижения Тогда
		Попытка
			НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Документ);
			НаборЗаписей.Прочитать();
			Для Каждого Товар Из ТаблицаТовары Цикл
				Приход = НаборЗаписей.Добавить();
				Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
				Приход.Период = Документ.Дата;
				Приход.ЗаказПоставщику = Документ;
				Приход.Организация = Организация;
				Приход.Номенклатура = Товар.Номенклатура;
				Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
				Приход.Цена = Товар.Цена;
				Приход.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
				Приход.Количество = Товар.Количество * Товар.Коэффициент;
				Приход.Потолок = Товар.Потолок;
				Приход.Сумма = Товар.Сумма; //#8742
			КонецЦикла;
			НаборЗаписей.Записать();
		Исключение
			Результат = Ложь;
			Сообщить("Ошибка записи заказа поставщику в регистр! " + ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОчиститьДвижения(Знач ДокументСсылка, Отказ) Экспорт
		
	Попытка
		НаборЗаписей = РегистрыНакопления.ЗаказыПоставщикам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);			
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		Сообщить("Ошибка записи в регистр ""Заказ поставщику""! " + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
КонецФункции
